Autodesk.Revit.DB.FilledRegion.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,System.Collections.Generic.IList{Autodesk.Revit.DB.CurveLoop})
Creates a filled region from the given boundaries.
Remarks:
The line style of the boundaries will be set to thin lines by default.
document:
The document in which to create the filled region.
typeId:
The filled region type Id.
viewId:
The view Id.
boundaries:
The boundaries.
Returns:
The newly created filled region.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The Id typeId is invalid.
-or-
Thrown if the viewId or typeId is invalid, or the view does not support
the detail items creation, or if the boundaries are empty, open, or self-intersecting.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013